# list_1 = [i for i in range (1,11) if i%2] 
# print(*list_1)
# list(map(str, input().split()))

# d = [int(a) for a in input().split()]
# l = list('abcdef') # разделить поэлементно
# print(l)


# a = int(input('введите число'))

# a = len(set(a))
# print(a)

# Дана последовательность из N целых чисел и число K. Необходимо сдвинуть всю последовательность
# (сдвиг - циклический) на K элементов вправо, K – положительное число.

# a = [int(a) for a in input().split()]
# k = int(input())
# i = 0
# while i < k:
#     poped = a.pop()
#     a.insert(0, poped)
#     i += 1
# print(a)

# Дан массив, состоящий из целых чисел. Напишите программу, которая подсчитает количество элементов массива, 
# больших предыдущего (элемента с предыдущим номером)
# Input: [0, -1, 5, 2, 3]
# Output: 2 (-1 < 5, 2 < 3)




